miyuushi/embeddedDOOM-lumo/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32c6"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_largeapp_no_ota.csv"
# end of Partition Table

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# end of Compiler options

#
# Component config
#

#
# LibC
#
CONFIG_LIBC_NEWLIB=y
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=n
# end of LibC

#
# ESP PSRAM
#

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=2048
# end of ESP System Settings

#
# FreeRTOS
#

#
# Kernel
#
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=1536
# end of Kernel

#
# Port
#
CONFIG_FREERTOS_IN_IRAM=y
# end of Port
# end of FreeRTOS

#
# IEEE 802.15.4
#
CONFIG_IEEE802154_ENABLED=n
# end of IEEE 802.15.4

#
# mbedTLS
#

#
# Core Configuration
#
CONFIG_MBEDTLS_THREADING_C=n
# end of Core Configuration

#
# TLS Protocol Configuration
#
CONFIG_MBEDTLS_TLS_DISABLED=y
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
# end of TLS Protocol Configuration
# end of mbedTLS

#
# SPI Flash driver
#

#
# Auto-detect flash chips
#
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=n
# end of Auto-detect flash chips
# end of SPI Flash driver
# end of ESP PSRAM
